<!-- add-pr-comment:terraform-plan -->

### Terraform Plan

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
google_iam_workload_identity_pool.github_actions_pool: Refreshing state... [id=projects/vaulted-zodiac-431004-s7/locations/global/workloadIdentityPools/github-oidc-pool]
google_project_service.activate_gcp_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=vaulted-zodiac-431004-s7/cloudresourcemanager.googleapis.com]
google_project_service.activate_gcp_services["cloudbuild.googleapis.com"]: Refreshing state... [id=vaulted-zodiac-431004-s7/cloudbuild.googleapis.com]
google_project_service.activate_gcp_services["run.googleapis.com"]: Refreshing state... [id=vaulted-zodiac-431004-s7/run.googleapis.com]
google_project_service.activate_gcp_services["containerregistry.googleapis.com"]: Refreshing state... [id=vaulted-zodiac-431004-s7/containerregistry.googleapis.com]
google_project_iam_member.shiron_sa_admin: Refreshing state... [id=vaulted-zodiac-431004-s7/roles/iam.serviceAccountAdmin/user:shiron4710@gmail.com]
data.google_service_account.terraform_sa: Reading...
google_project_service.project: Refreshing state... [id=vaulted-zodiac-431004-s7/iamcredentials.googleapis.com]
google_iam_workload_identity_pool_provider.github_actions: Refreshing state... [id=projects/vaulted-zodiac-431004-s7/locations/global/workloadIdentityPools/github-oidc-pool/providers/github-actions]
data.google_service_account.terraform_sa: Read complete after 0s [id=projects/vaulted-zodiac-431004-s7/serviceAccounts/terraform@vaulted-zodiac-431004-s7.iam.gserviceaccount.com]
google_service_account_iam_member.terraform_sa_workload_identity_user: Refreshing state... [id=projects/vaulted-zodiac-431004-s7/serviceAccounts/terraform@vaulted-zodiac-431004-s7.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/494673853308/locations/global/workloadIdentityPools/github-oidc-pool/attribute.repository/halcyon-org/belifeline-infra]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_compute_firewall.allow_https_specific will be created
  + resource "google_compute_firewall" "allow_https_specific" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-https-specific"
      + network            = "default"
      + priority           = 1000
      + project            = "vaulted-zodiac-431004-s7"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "103.2.36.0/22",
        ]
      + target_tags        = [
          + "web",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.deny_https_others will be created
  + resource "google_compute_firewall" "deny_https_others" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "deny-https-others"
      + network            = "default"
      + priority           = 1000
      + project            = "vaulted-zodiac-431004-s7"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "web",
        ]

      + deny {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + effective_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-small"
      + metadata             = {
          + "ssh-keys" = "user:ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJZ+Vh84iPZs3O/cKdfWJR4uZKkPG9pxXXIOr9DKxoMr"
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "sevpn"
      + project              = "vaulted-zodiac-431004-s7"
      + self_link            = (known after apply)
      + tags                 = [
          + "web",
        ]
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                 = "asia-northeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image                  = "debian-cloud/debian-11"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + size                   = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config (known after apply)

      + guest_accelerator (known after apply)

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity (known after apply)

      + scheduling (known after apply)

      + service_account {
          + email  = "494673853308-compute@developer.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }

      + shielded_instance_config {
          + enable_integrity_monitoring = true
          + enable_secure_boot          = true
          + enable_vtpm                 = true
        }
    }

  # google_project_iam_member.shiron_iam_admin will be created
  + resource "google_project_iam_member" "shiron_iam_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:shiron4710@gmail.com"
      + project = "vaulted-zodiac-431004-s7"
      + role    = "roles/iam.securityAdmin"
    }

  # google_project_iam_member.shiron_sa_admin will be destroyed
  # (because google_project_iam_member.shiron_sa_admin is not in configuration)
  - resource "google_project_iam_member" "shiron_sa_admin" {
      - etag    = "BwYkbuMxauo=" -> null
      - id      = "vaulted-zodiac-431004-s7/roles/iam.serviceAccountAdmin/user:shiron4710@gmail.com" -> null
      - member  = "user:shiron4710@gmail.com" -> null
      - project = "vaulted-zodiac-431004-s7" -> null
      - role    = "roles/iam.serviceAccountAdmin" -> null
    }

  # google_project_service.activate_gcp_services["cloudbuild.googleapis.com"] will be destroyed
  # (because google_project_service.activate_gcp_services is not in configuration)
  - resource "google_project_service" "activate_gcp_services" {
      - disable_on_destroy = true -> null
      - id                 = "vaulted-zodiac-431004-s7/cloudbuild.googleapis.com" -> null
      - project            = "vaulted-zodiac-431004-s7" -> null
      - service            = "cloudbuild.googleapis.com" -> null
    }

  # google_project_service.activate_gcp_services["cloudresourcemanager.googleapis.com"] will be destroyed
  # (because google_project_service.activate_gcp_services is not in configuration)
  - resource "google_project_service" "activate_gcp_services" {
      - disable_on_destroy = true -> null
      - id                 = "vaulted-zodiac-431004-s7/cloudresourcemanager.googleapis.com" -> null
      - project            = "vaulted-zodiac-431004-s7" -> null
      - service            = "cloudresourcemanager.googleapis.com" -> null
    }

  # google_project_service.activate_gcp_services["containerregistry.googleapis.com"] will be destroyed
  # (because google_project_service.activate_gcp_services is not in configuration)
  - resource "google_project_service" "activate_gcp_services" {
      - disable_on_destroy = true -> null
      - id                 = "vaulted-zodiac-431004-s7/containerregistry.googleapis.com" -> null
      - project            = "vaulted-zodiac-431004-s7" -> null
      - service            = "containerregistry.googleapis.com" -> null
    }

  # google_project_service.activate_gcp_services["run.googleapis.com"] will be destroyed
  # (because google_project_service.activate_gcp_services is not in configuration)
  - resource "google_project_service" "activate_gcp_services" {
      - disable_on_destroy = true -> null
      - id                 = "vaulted-zodiac-431004-s7/run.googleapis.com" -> null
      - project            = "vaulted-zodiac-431004-s7" -> null
      - service            = "run.googleapis.com" -> null
    }

Plan: 4 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  + instance_external_ip = (known after apply)
  + instance_name        = "sevpn"
  + instance_self_link   = (known after apply)
  + instance_zone        = "asia-northeast1-a"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>